In [8]:
# Create DataFrame
import numpy as np
import pandas as pd
data=np.arange(0,20).reshape(4,5)
df=pd.DataFrame(data,index=['row 1','row 2','row 3','row 4'],
                columns=['col 1','col 2','col 3','col 4','col 5'])
df

       col 1  col 2  col 3  col 4  col 5
row 1      0      1      2      3      4
row 2      5      6      7      8      9
row 3     10     11     12     13     14
row 4     15     16     17     18     19

In [14]:
#Type
print('Type :',type(df))
#Info
df.info()
#Describe
df.describe()

Type : <class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, row 1 to row 4
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col 1   4 non-null      int32
 1   col 2   4 non-null      int32
 2   col 3   4 non-null      int32
 3   col 4   4 non-null      int32
 4   col 5   4 non-null      int32
dtypes: int32(5)
memory usage: 112.0+ bytes

           col 1      col 2      col 3      col 4      col 5
count   4.000000   4.000000   4.000000   4.000000   4.000000
mean    7.500000   8.500000   9.500000  10.500000  11.500000
std     6.454972   6.454972   6.454972   6.454972   6.454972
min     0.000000   1.000000   2.000000   3.000000   4.000000
25%     3.750000   4.750000   5.750000   6.750000   7.750000
50%     7.500000   8.500000   9.500000  10.500000  11.500000
75%    11.250000  12.250000  13.250000  14.250000  15.250000
max    15.000000  16.000000  17.000000  18.000000  19.000000

In [18]:
#indexing
#column name

df[['col 1','col 2','col 3','col 4','col 5']]

       col 1  col 2  col 3  col 4  col 5
row 1      0      1      2      3      4
row 2      5      6      7      8      9
row 3     10     11     12     13     14
row 4     15     16     17     18     19

In [19]:
df['col 1']

row 1     0
row 2     5
row 3    10
row 4    15
Name: col 1, dtype: int32

In [20]:
df.loc['row 1']

col 1    0
col 2    1
col 3    2
col 4    3
col 5    4
Name: row 1, dtype: int32

In [22]:
df.loc[['row 1','row 2']]

       col 1  col 2  col 3  col 4  col 5
row 1      0      1      2      3      4
row 2      5      6      7      8      9

In [23]:
df

       col 1  col 2  col 3  col 4  col 5
row 1      0      1      2      3      4
row 2      5      6      7      8      9
row 3     10     11     12     13     14
row 4     15     16     17     18     19

In [26]:
df.iloc[0:2,0:3]

       col 1  col 2  col 3
row 1      0      1      2
row 2      5      6      7

In [27]:
df.isnull()

       col 1  col 2  col 3  col 4  col 5
row 1  False  False  False  False  False
row 2  False  False  False  False  False
row 3  False  False  False  False  False
row 4  False  False  False  False  False

In [33]:
df.iloc[0,2]=None
df.iloc[1,2]=None

In [34]:
df

       col 1  col 2  col 3  col 4  col 5
row 1      0      1    NaN      3      4
row 2      5      6    NaN      8      9
row 3     10     11   12.0     13     14
row 4     15     16   17.0     18     19

In [35]:
df.isnull()

       col 1  col 2  col 3  col 4  col 5
row 1  False  False   True  False  False
row 2  False  False   True  False  False
row 3  False  False  False  False  False
row 4  False  False  False  False  False

In [36]:
df.isnull().sum()

col 1    0
col 2    0
col 3    2
col 4    0
col 5    0
dtype: int64

In [37]:
df.value_counts()

col 1  col 2  col 3  col 4  col 5
10     11     12.0   13     14       1
15     16     17.0   18     19       1
dtype: int64

In [39]:
df['col 3'].value_counts()

12.0    1
17.0    1
Name: col 3, dtype: int64

In [43]:
df['col 3'].unique

<bound method Series.unique of row 1     NaN
row 2     NaN
row 3    12.0
row 4    17.0
Name: col 3, dtype: float64>

In [45]:
#Data Frame to Array
array=df.values
array

array([[ 0.,  1., nan,  3.,  4.],
       [ 5.,  6., nan,  8.,  9.],
       [10., 11., 12., 13., 14.],
       [15., 16., 17., 18., 19.]])